code-review/NRB_3471_3546/База_Стало/Reports/ОстаткиИОбороты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ОстаткиИОбороты</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмещениеДополнительныхПолей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьПоказателиВРазныхКолонках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимРасшифровки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаскрашиватьИзмерения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Группировка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипГруппировки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеПоля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Reports/ОстаткиИОбороты/Forms/ФормаОтчетаПрограммная/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("РежимРасшифровки") Тогда
		Отчет.РежимРасшифровки = Параметры.РежимРасшифровки;
	Иначе
		Отчет.РежимРасшифровки = Ложь;
	КонецЕсли;
	
	УстановитьУсловноеОформлениеТипГруппировки();
	КлючТекущихПользовательскихНастроек = Новый УникальныйИдентификатор;
	Отчет.РаскрашиватьИзмерения = Истина;
	ЗаполнитьГруппировки();
	Отчет.ДатаНачала = Параметры.ДатаНачала;
	Отчет.ДатаОкончания = Параметры.ДатаОкончания;
	Отчет.Раздел = Параметры.Раздел;
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Параметры.Вариант);
	Отчет.КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(Параметры.ПользовательскиеНастройки);
	СохранитьНастройкиРазделаНаСервере();
	СкомпоноватьРезультат();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументРезультатВыбор(Элемент, Область, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

#Область Сервис

&НаСервере
Процедура СохранитьНастройкиРазделаНаСервере()
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ОтчетОбъект.СохранитьНастройкиРаздела(Отчет.КомпоновщикНастроек);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГруппировки()

	ПолеГруппировки = Отчет.Группировка.Добавить();
	ПолеГруппировки.Использование = Истина;
	ПолеГруппировки.Поле = "Периоды.ПериодДень";
	ПолеГруппировки.Представление = "Период";
	ПолеГруппировки.ТипГруппировки = 0;

	ПолеГруппировки = Отчет.Группировка.Добавить();
	ПолеГруппировки.Использование = Истина;
	ПолеГруппировки.Поле = "ЦБ";
	ПолеГруппировки.Представление = "Ценная бумага";
	ПолеГруппировки.ТипГруппировки = 0;

	ПолеГруппировки = Отчет.Группировка.Добавить();
	ПолеГруппировки.Использование = Истина;
	ПолеГруппировки.Поле = "СчетДепоМХ";
	ПолеГруппировки.Представление = "Счет депо МХ";
	ПолеГруппировки.ТипГруппировки = 0;
	
	ПолеГруппировки = Отчет.Группировка.Добавить();
	ПолеГруппировки.Использование = Истина;
	ПолеГруппировки.Поле = "РазделСчетаДепоМХ";
	ПолеГруппировки.Представление = "Раздел счета депо МХ";
	ПолеГруппировки.ТипГруппировки = 0;
	
	ПолеГруппировки = Отчет.Группировка.Добавить();
	ПолеГруппировки.Использование = Истина;
	ПолеГруппировки.Поле = "СчетДепо";
	ПолеГруппировки.Представление = "Счет депо";
	ПолеГруппировки.ТипГруппировки = 0;
	
	ПолеГруппировки = Отчет.Группировка.Добавить();
	ПолеГруппировки.Использование = Истина;
	ПолеГруппировки.Поле = "РазделСчетаДепо";
	ПолеГруппировки.Представление = "Раздел счета депо";
	ПолеГруппировки.ТипГруппировки = 0;
	
	Показатель = Отчет.Показатели.Добавить();
	Показатель.Использование = Истина;
	Показатель.Поле = "Количество";
	Показатель.Представление = "Количество";
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеТипГруппировки()
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='Без групп'"));
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ГруппировкаТипГруппировки");
	
	Элемент = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Отчет.Группировка.ТипГруппировки");
	Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Элемент.ПравоеЗначение = 0;
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='С группами'"));
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ГруппировкаТипГруппировки");
	
	Элемент = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Отчет.Группировка.ТипГруппировки");
	Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Элемент.ПравоеЗначение = 1;
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='Только группы'"));
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ГруппировкаТипГруппировки");
	
	Элемент = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Отчет.Группировка.ТипГруппировки");
	Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Элемент.ПравоеЗначение = 2;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
